{
    "intents": [
        {
            "tag": "greeting",
            "patterns": [
                "Hi", "Hello", "Hey there", "Good day", "Greetings",
                "How are you", "What's up", "Hello chatbot",
                "Is anyone there", "Can you help me",
                "Kumusta", "Magandang araw", "Helo",
                "Tulungan mo ako", "Nandiyan ka ba"
            ],
            "responses": [
                "Hello! I'm here to answer your questions about Northwestern University's history.",
                "Hi there! How can I help you learn about Northwestern University?",
                "Greetings! Ask me anything about Northwestern University's past.",
                "Welcome! I’m the Northwestern University History Chatbot. What would you like to know?"
            ]
        },
        {
            "tag": "general_info",
            "patterns": [
                "What is Northwestern University?",
                "Tell me about the university",
                "Northwestern University",
                "University",
                "Northwestern",
                "Ano ang Northwestern University?",
                "Tungkol saan ang unibersidad?",
                "Ano ang Northwestern?"
            ],
            "responses": [
                "Northwestern University has a rich history that began as Northwestern Academy, Inc. in 1932. It became Northwestern College in 1949 and achieved University Status in 1993.",
                "Founded in 1932, Northwestern University evolved from an academy to a full-fledged university. Would you like to know more about its founders, major programs, or accreditations?",
                "To give you the best details, could you ask a specific question—such as 'When was the nursing program started?' or 'Who was the first university president?'"
            ]
        },
        {
            "tag": "founding_and_early_years",
            "patterns": [
                "When was Northwestern founded?",
                "What was the school originally called?",
                "When did Northwestern Academy become a college?",
                "What was the first year of operation?",
                "What happened in 1932?",
                "Kailan itinatag ang Northwestern?",
                "Ano ang orihinal na pangalan ng paaralan?",
                "Kailan naging kolehiyo ang Northwestern Academy?",
                "Anong taon nagsimula ang operasyon?"
            ],
            "responses": [
                "Northwestern Academy, Inc. was incorporated in 1932 and began operations that same year, offering General Secondary, Commercial Secondary, and Home Economics programs.",
                "The institution was originally called Northwestern Academy, Inc. when it was founded in 1932.",
                "It became Northwestern College in 1949."
            ]
        },
        {
            "tag": "major_transitions",
            "patterns": [
                "When did the school become a university?",
                "What year did they get university status?",
                "When was the official confirmation of university status?",
                "What year was the 50th anniversary?",
                "Kailan naging unibersidad ang paaralan?",
                "Anong taon nakuha ang university status?",
                "Kailan ang opisyal na kumpirmasyon ng university status?",
                "Anong taon ang ika-50 anibersaryo?"
            ],
            "responses": [
                "Northwestern College was granted University Status in 1993. The official confirmation was issued by the Ministry of Education, Culture and Sports on January 13, 1994.",
                "The 50th founding anniversary of Northwestern College was celebrated in 1982."
            ]
        },
        {
            "tag": "university_incorporators",
            "patterns": [
                "Who were the incorporators of Northwestern University?",
                "List the incorporators of Northwestern University.",
                "Who are the original incorporators of Northwestern?",
                "Who helped establish Northwestern University?",
                "Who were part of the group that incorporated Northwestern?",
                "Sino ang mga nag-incorporate ng Northwestern University?",
                "Ilista ang mga incorporator ng Northwestern.",
                "Sino ang mga tumulong magtatag ng Northwestern University?"
            ],
            "responses": [
                "The incorporators of Northwestern University were Marcelino G. Ligot, Manuel E. Pintado, Angel A. Albano, Manuela A. Castisimo, Encarnacion L. Ruiz, Marcelo A. Tajon, and Rufina S. Mariano."
            ]
        },
        {
            "tag": "angel_albano_history",
            "patterns": [
                "Who was Angel A. Albano?",
                "Tell me about Angel A. Albano’s contribution to Northwestern University.",
                "What was Angel A. Albano’s role in Northwestern University?",
                "Who was one of the founders named Angel A. Albano?",
                "Who was Angel Albano in the history of Northwestern University?",
                "Sino si Angel A. Albano?",
                "Ano ang kontribusyon ni Angel A. Albano sa Northwestern?",
                "Ano ang papel ni Angel A. Albano?"
            ],
            "responses": [
                "Angel A. Albano was one of the founders of Northwestern University. He was known for his diligence and was instrumental in establishing the institution during its formative years."
            ]
        },
        {
            "tag": "cresencio_barangan_history",
            "patterns": [
                "Who was Cresencio J. Barangan?",
                "Tell me about Cresencio J. Barangan’s contribution to Northwestern University.",
                "What was Cresencio J. Barangan’s role in Northwestern University?",
                "Who was known as the faithful steward of Northwestern University?",
                "Who managed the university funds during the early years?",
                "Sino si Cresencio J. Barangan?",
                "Ano ang kontribusyon ni Cresencio J. Barangan?",
                "Sino ang tapat na tagapamahala ng pondo ng unibersidad?"
            ],
            "responses": [
                "Cresencio J. Barangan was one of the founding fathers and served as the university’s cashier. He was known for his honesty and dedication in managing Northwestern’s funds and ensuring financial integrity."
            ]
        },
        {
            "tag": "nicolas_contribution",
            "patterns": [
                "What did Nicolas N. Nicolas do for Northwestern University?",
                "What were the contributions of Nicolas N. Nicolas to Northwestern?",
                "How did Nicolas N. Nicolas help the school?",
                "Nicolas N. Nicolas contributions",
                "What did the founder do for Northwestern?",
                "Ano ang ginawa ni Nicolas N. Nicolas para sa Northwestern University?",
                "Ano ang mga kontribusyon ni Nicolas N. Nicolas?"
            ],
            "responses": [
                "Nicolas N. Nicolas played a major role in expanding Northwestern University’s academic offerings, particularly in law, engineering, nursing, business, education, and criminology."
            ]
        },
        {
            "tag": "nicolas_role",
            "patterns": [
                "What position did Nicolas N. Nicolas hold at Northwestern?",
                "Was Nicolas N. Nicolas the chairman of the board?",
                "What leadership role did Nicolas N. Nicolas have?",
                "What was Nicolas N. Nicolas's role in Northwestern University?",
                "What office did the founder hold at Northwestern?",
                "Ano ang posisyon ni Nicolas N. Nicolas?",
                "Siya ba ang chairman ng board?",
                "Ano ang leadership role ni Nicolas N. Nicolas?"
            ],
            "responses": [
                "Nicolas N. Nicolas was the longest-serving Chairman of the Board of Directors of Northwestern University, providing strong leadership during its key development years."
            ]
        },
        {
            "tag": "nicolas_title",
            "patterns": [
                "Why was Nicolas N. Nicolas called 'Mr. Northwestern'?",
                "Who was called Mr. Northwestern?",
                "How did Nicolas N. Nicolas earn the title Mr. Northwestern?",
                "Why is the founder referred to as Mr. Northwestern?",
                "Who earned the title Mr. Northwestern at the school?",
                "Bakit tinawag si Nicolas N. Nicolas na 'Mr. Northwestern'?",
                "Sino ang tinawag na Mr. Northwestern?"
            ],
            "responses": [
                "Nicolas N. Nicolas was called 'Mr. Northwestern' because of his lifelong dedication and major contributions to the university’s growth and development."
            ]
        },
        {
            "tag": "northwestern_fiat_lux_meaning",
            "patterns": [
                "What does Fiat Lux mean in Northwestern University?",
                "What is the meaning of Northwestern University's motto?",
                "What does the phrase Fiat Lux represent for Northwestern?",
                "Explain the symbolism of Fiat Lux in Northwestern University history.",
                "Ano ang ibig sabihin ng Fiat Lux sa Northwestern University?",
                "Ano ang kahulugan ng motto ng Northwestern University?",
                "Ano ang kinakatawan ng Fiat Lux?"
            ],
            "responses": [
                "The phrase 'Fiat Lux' means 'Let there be light'. It is Northwestern University’s motto, symbolizing enlightenment through education and the pursuit of knowledge."
            ]
        },
        {
            "tag": "northwestern_logo_symbolism",
            "patterns": [
                "What is the logo of Northwestern University?",
                "Why is the owl used in Northwestern University’s logo?",
                "What does the owl represent in Northwestern University?",
                "What is the meaning of the Northwestern University symbol?",
                "Ano ang logo ng Northwestern University?",
                "Bakit owl ang ginamit sa logo?",
                "Ano ang sinisimbolo ng owl sa Northwestern?"
            ],
            "responses": [
                "The owl is the official logo of Northwestern University. It symbolizes wisdom, knowledge, and insight—values that guide the university’s mission to enlighten learners."
            ]
        },
        {
            "tag": "key_infrastructure_and_land",
            "patterns": [
                "When was the Nalbo campus lot acquired?",
                "Where is the main campus located?",
                "When was the first computer center established?",
                "When was the Alumni House completed?",
                "Kailan nakuha ang lupa sa Nalbo campus?",
                "Nasaan ang main campus?",
                "Kailan itinatag ang unang computer center?",
                "Kailan natapos ang Alumni House?"
            ],
            "responses": [
                "The 8.9-hectare lot in Barangay Nalbo, Laoag City was purchased in 1962. Relocation of courses to the new campus began in 1969.",
                "The first computer center in Region I (Ilocos Region) was inaugurated in 1983.",
                "The Alumni House was completed in 2007."
            ]
        },
        {
            "tag": "program_pioneering",
            "patterns": [
                "When was the Nursing program started?",
                "What about the Criminology program?",
                "When did the College of Law reopen?",
                "When did they first offer engineering courses?",
                "What new programs opened in 2005?",
                "Kailan nagsimula ang Nursing program?",
                "Kailan nagsimula ang Criminology program?",
                "Kailan muling binuksan ang College of Law?",
                "Kailan sila unang nag-alok ng engineering courses?"
            ],
            "responses": [
                "The BS in Nursing program started in 1973.",
                "The BS in Criminology program (now Criminal Justice) was first offered in 1969.",
                "The College of Law was reopened in 1984.",
                "Engineering programs began in the 1970s. Civil Engineering was added in 1960, Mechanical Engineering in 1971, and Electrical Engineering in 1978. BS Computer Engineering and BS Electronics and Communication Engineering followed in 1990.",
                "In 2005, new programs included BS in Library and Information Science, BS in Actuarial Science, BS in Statistics, and BS in Commerce major in E-Business."
            ]
        },
        {
            "tag": "accreditation_and_distinctions",
            "patterns": [
                "What is the ISO certification status?",
                "When did the programs get Level II accreditation?",
                "What major awards did the university receive in 2004?",
                "When did Northwestern get Deregulated Status?",
                "Ano ang ISO certification status?",
                "Kailan nakakuha ng Level II accreditation?",
                "Ano ang mga pangunahing parangal noong 2004?",
                "Kailan nakuha ng Northwestern ang Deregulated Status?"
            ],
            "responses": [
                "Northwestern University received ISO 9001:1994 certification in 2000 and ISO 9001:2000 certification in 2004.",
                "Initial Level II accreditation for major programs such as Arts and Sciences, Commerce, and Education was granted in 1991.",
                "In 2004, Northwestern University ranked 3rd nationwide by PACUCOA for having the most accredited programs and was number one in Region I.",
                "The university was granted Deregulated Status by CHED in 2003."
            ]
        },
        {
            "tag": "leadership_and_presidents",
            "patterns": [
                "Who was the first university president?",
                "Who was Ben A. Nicolas?",
                "When was Ben A. Nicolas first appointed president?",
                "Sino ang unang university president?",
                "Sino si Ben A. Nicolas?",
                "Kailan unang na-appoint si Ben A. Nicolas bilang presidente?"
            ],
            "responses": [
                "Jose G. Castro was the first University President, appointed in 1989.",
                "Ben A. Nicolas was a key leader who served as president and chairman in 1982 and later as university president in 1997. He was known for his visionary leadership and reforms.",
                "Ben A. Nicolas was first appointed president of Northwestern College in 1982 and formally invested in 1983."
            ]
        }
    ]
}
