{
    "intents": [
        {
            "tag": "greeting",
            "patterns": [
                "Hi",
                "Hello",
                "Hey there",
                "Good day",
                "Greetings",
                "How are you",
                "What's up",
                "hello chatbot",
                "is anyone there",
                "can you help me",
                "Kumusta",
                "Magandang araw",
                "Helo",
                "Tulungan mo ako",
                "Nandiyan ka ba"
            ],
            "responses": [
                "Hello! I'm here to answer your questions about Northwestern University's history.",
                "Hi there! How can I help you learn about Northwestern?",
                "Greetings! Ask me anything about the university's history.",
                "Welcome! I am the Northwestern University History Chatbot. What can I tell you about?"
            ]
        },
        {
            "tag": "general_info",
            "patterns": [
                "What is Northwestern University?",
                "Tell me about the university",
                "Northwestern University",
                "university",
                "northwestern",
                "Ano ang Northwestern University?",
                "Tungkol saan ang unibersidad?",
                "Ano ang Northwestern?"
            ],
            "responses": [
                "Northwestern University has a rich history, beginning as Northwestern Academy, Inc. in 1932. It transitioned to Northwestern College in 1949 and was granted University Status in 1993. What specific historical detail are you interested in?",
                "I can tell you about Northwestern University's history, from its founding in 1932 to its University Status in 1993. Do you want to know about its founders, major programs, or accreditations?",
                "To give you the best information, could you ask a specific question? For example, 'When was the nursing program started?' or 'Sino ang unang university president?'"
            ]
        },
        {
            "tag": "founding_and_early_years",
            "patterns": [
                "When was Northwestern founded?",
                "What was the school originally called?",
                "When did Northwestern Academy become a College?",
                "What was the first year of operation?",
                "What happened in 1932?",
                "Kailan itinatag ang Northwestern?",
                "Ano ang orihinal na pangalan ng paaralan?",
                "Kailan naging Kolehiyo ang Northwestern Academy?",
                "Anong taon nagsimula ang operasyon?"
            ],
            "responses": [
                "Northwestern Academy, Inc. was incorporated in *1932*. It gained government permit to offer General Secondary, Commercial Secondary, and Home Economics in the same year.",
                "The institution was originally founded as *Northwestern Academy, Inc.* in 1932.",
                "The conversion from Northwestern Academy to *Northwestern College* occurred in *1949*."
            ]
        },
        {
            "tag": "major_transitions",
            "patterns": [
                "When did the school become a University?",
                "What year did they get University Status?",
                "When was the official confirmation of University Status?",
                "What year was the 50th anniversary?",
                "Kailan naging Unibersidad ang paaralan?",
                "Anong taon nakuha ang University Status?",
                "Kailan ang opisyal na kumpirmasyon ng University Status?",
                "Anong taon ang ika-50 anibersaryo?"
            ],
            "responses": [
                "Northwestern College was granted *University Status* in *1993*. The official confirmation was issued by the Ministry of Education, Culture and Sports on *January 13, 1994*.",
                "The 50th founding anniversary of Northwestern College was celebrated in *1982*."
            ]
        },
        {
            "tag": "university_incorporators",
            "patterns": [
                "Who were the incorporators of Northwestern University?",
                "List the incorporators of Northwestern University.",
                "Who are the original incorporators of Northwestern?",
                "Who helped establish Northwestern University?",
                "Who were part of the group that incorporated Northwestern?",
                "Sino ang mga nag-incorporate ng Northwestern University?",
                "Ilista ang mga incorporator ng Northwestern.",
                "Sino ang mga tumulong magtatag ng Northwestern University?"
            ],
            "responses": [
                "The incorporators of Northwestern University were Marcelino G. Ligot, Manuel E. Pintado, Angel A. Albano, Manuela A. Castisimo, Encarnacion L. Ruiz, Marcelo A. Tajon, and Rufina S. Mariano."
            ]
        },
        {
            "tag": "angel_albano_history",
            "patterns": [
                "Who was Angel A. Albano?",
                "Tell me about Angel A. Albano’s contribution to Northwestern University.",
                "What was Angel A. Albano’s role in Northwestern University?",
                "Who was one of the founders named Angel A. Albano?",
                "Who was Angel Albano in the history of Northwestern University?",
                "Sino si Angel A. Albano?",
                "Ano ang kontribusyon ni Angel A. Albano sa Northwestern?",
                "Ano ang papel ni Angel A. Albano?"
            ],
            "responses": [
                "Angel A. Albano was one of the founders of Northwestern University. He is remembered as a model of diligence and was among the key figures who helped establish the institution during its humble beginnings."
            ]
        },
        {
            "tag": "cresencio_barangan_history",
            "patterns": [
                "Who was Cresencio J. Barangan?",
                "Tell me about Cresencio J. Barangan’s contribution to Northwestern University.",
                "What was Cresencio J. Barangan’s role in Northwestern University?",
                "Who was known as the faithful steward of Northwestern University?",
                "Who managed the university funds during the early years of Northwestern University?",
                "Sino si Cresencio J. Barangan?",
                "Ano ang kontribusyon ni Cresencio J. Barangan?",
                "Sino ang tapat na tagapamahala ng pondo ng unibersidad?"
            ],
            "responses": [
                "Cresencio J. Barangan was one of the founding fathers of Northwestern University and served as its cashier. He was known for his honesty and faithfulness in protecting the university’s funds and ensuring proper financial management. He earned his degree from Washington State College in the United States while working to support his studies, and later devoted his life to serving Northwestern University."
            ]
        },
        {
            "tag": "nicolas_contribution",
            "patterns": [
                "What did Nicolas N. Nicolas do for Northwestern University?",
                "What were the contributions of Nicolas N. Nicolas to Northwestern?",
                "How did the founder Nicolas N. Nicolas help the school?",
                "Nicolas N. Nicolas contributions",
                "What did the founder do for Northwestern?",
                "Ano ang ginawa ni Nicolas N. Nicolas para sa Northwestern University?",
                "Ano ang mga kontribusyon ni Nicolas N. Nicolas?"
            ],
            "responses": [
                "Nicolas N. Nicolas laid a strong foundation for Northwestern University. He led the institution in its early growth, expanding opportunities for students who wanted to pursue careers in law, engineering, nursing, business, education, and criminology."
            ]
        },
        {
            "tag": "nicolas_role",
            "patterns": [
                "What position did Nicolas N. Nicolas hold at Northwestern?",
                "Was Nicolas N. Nicolas the chairman of the board?",
                "What leadership role did the founder Nicolas N. Nicolas have?",
                "What was Nicolas N. Nicolas's role in Northwestern University?",
                "What office did the founder hold at Northwestern?",
                "Ano ang posisyon ni Nicolas N. Nicolas?",
                "Siya ba ang chairman ng board?",
                "Ano ang leadership role ni Nicolas N. Nicolas?"
            ],
            "responses": [
                "Nicolas N. Nicolas served as the longest-serving Chairman of the Board of Directors of Northwestern University. He provided leadership and direction during the institution’s formative years."
            ]
        },
        {
            "tag": "nicolas_title",
            "patterns": [
                "Why was Nicolas N. Nicolas called 'Mr. Northwestern'?",
                "Who was called Mr. Northwestern?",
                "How did Nicolas N. Nicolas earn the title Mr. Northwestern?",
                "Why is the founder referred to as Mr. Northwestern?",
                "Who earned the title Mr. Northwestern at the school?",
                "Bakit tinawag si Nicolas N. Nicolas na 'Mr. Northwestern'?",
                "Sino ang tinawag na Mr. Northwestern?"
            ],
            "responses": [
                "Nicolas N. Nicolas earned the title 'Mr. Northwestern' because of his unmatched dedication and major role in building and shaping the university. His colleagues, students, and the community gave him this recognition for his lifelong service."
            ]
        },
        {
            "tag": "northwestern_fiat_lux_meaning",
            "patterns": [
                "What does Fiat Lux mean in Northwestern University?",
                "What is the meaning of Northwestern University's motto?",
                "What does the phrase Fiat Lux represent for Northwestern?",
                "Explain the symbolism of Fiat Lux in Northwestern University history.",
                "Ano ang ibig sabihin ng Fiat Lux sa Northwestern University?",
                "Ano ang kahulugan ng motto ng Northwestern University?",
                "Ano ang kinakatawan ng Fiat Lux?"
            ],
            "responses": [
                "The phrase 'Fiat Lux', which means 'Let there be light', serves as Northwestern University's guiding motto. It symbolizes the founders’ mission to bring enlightenment through education, spreading the flame of knowledge to future generations and inspiring the institution’s continued growth and resilience."
            ]
        },
        {
            "tag": "northwestern_logo_symbolism",
            "patterns": [
                "What is the logo of Northwestern University?",
                "Why is the owl used in Northwestern University’s logo?",
                "What does the owl represent in Northwestern University?",
                "What is the meaning of the Northwestern University symbol?",
                "Ano ang logo ng Northwestern University?",
                "Bakit owl ang ginamit sa logo?",
                "Ano ang sinisimbolo ng owl sa Northwestern?"
            ],
            "responses": [
                "The owl is the official logo of Northwestern University. It was chosen because it symbolizes wisdom, knowledge, and insight. The founders selected the owl to represent their mission of developing human potential and guiding learners to see clearly through the darkness of ignorance."
            ]
        },
        {
            "tag": "key_infrastructure_and_land",
            "patterns": [
                "When was the Nalbo campus lot acquired?",
                "Where is the main campus located?",
                "When was the first computer center established?",
                "When was the Alumni House completed?",
                "Kailan nakuha ang lupa sa Nalbo campus?",
                "Nasaan ang main campus?",
                "Kailan itinatag ang unang computer center?",
                "Kailan natapos ang Alumni House?"
            ],
            "responses": [
                "The *8.9-hectare lot in Barangay Nalbo, Laoag City* was purchased in *1962*, and the relocation of some courses to the new campus began in 1969.",
                "The *first computer center in Region I/Ilocos Region* was inaugurated and blessed in *1983*.",
                "The *Alumni House* was completed in *2007*."
            ]
        },
        {
            "tag": "program_pioneering",
            "patterns": [
                "When was the Nursing program started?",
                "What about the Criminology program?",
                "When did the College of Law reopen?",
                "When did they first offer engineering courses?",
                "What new programs opened in 2005?",
                "Kailan nagsimula ang Nursing program?",
                "Kailan nagsimula ang Criminology program?",
                "Kailan muling binuksan ang College of Law?",
                "Kailan sila unang nag-alok ng engineering courses?"
            ],
            "responses": [
                "The *BS in Nursing* program was first offered in *1973*.",
                "The *BS in Criminology* program (now Criminal Justice) was first permitted in *1969*.",
                "The *College of Law was reopened* (allowed to resume operation) in *1984*.",
                "Initial Engineering programs were recognized in the 1970s, but Civil Engineering was added in 1960. Mechanical Engineering got government recognition in 1971, and Electrical Engineering in 1978. In 1990, BS Computer Engineering and BS in Electronics and Communication Engineering were added.",
                "In 2005, new programs included BS in Library and Information Science, BS in Actuarial Science, BS in Statistics, and BS in Commerce major in E-Business."
            ]
        },
        {
            "tag": "accreditation_and_distinctions",
            "patterns": [
                "What is the ISO certification status?",
                "When did the programs get Level II accreditation?",
                "What major awards did the university receive in 2004?",
                "When did Northwestern get Deregulated Status?",
                "Ano ang ISO certification status?",
                "Kailan nakakuha ng Level II accreditation?",
                "Ano ang mga pangunahing parangal noong 2004?",
                "Kailan nakuha ng Northwestern ang Deregulated Status?"
            ],
            "responses": [
                "The university received *ISO 9001:1994* certification in *2000* and *ISO 9001:2000* certification in *2004*.",
                "Initial Level II accreditation for major programs (Arts and Sciences, Commerce, Education) was granted in *1991*.",
                "In *2004*, Northwestern University was ranked *3rd place nationally* by PACUCOA for the most accredited programs and *number one in Region I*.",
                "The university was granted *Deregulated Status* by CHED in *2003*."
            ]
        },
        {
            "tag": "leadership_and_presidents",
            "patterns": [
                "Who was the first university president?",
                "Who was Ben A. Nicolas?",
                "When was Ben A. Nicolas first appointed president?",
                "Sino ang unang university president?",
                "Sino si Ben A. Nicolas?",
                "Kailan unang na-appoint si Ben A. Nicolas bilang presidente?"
            ],
            "responses": [
                "*Jose G. Castro* is recognized as the *First University President* (appointed in 1989).",
                "*Ben A. Nicolas* was a key leader, appointed president and chairman in 1982. He was later appointed university president in *1997* and was a visionary leader who pushed for university status and reforms.",
                "Ben A. Nicolas was first appointed president of Northwestern College in *1982* and formally invested in 1983."
            ]
        }
    ]
}
